import Link from "next/link";
import WebBlackButton from "../../../commons/buttons/buttonDesktop/WebBlackButton";
import * as S from "../agreement/styles";

export default function Privacy() {
  return (
    <>
      <S.Container>
        <S.TitleBox>
          <S.Title>개인정보 처리방침</S.Title>
          <S.HighLighting></S.HighLighting>
        </S.TitleBox>

        <S.ContentsBox>
          <p>
            개인정보 취급방침 roominus (이하 “회사”라 함)는 정보주체의
            개인정보를 소중하게 생각하며,「개인정보 보호법」,「정보통신망
            이용촉진 및 정보보호 등에 관한 법률(이하 “정보통신망법”이라 함)」등
            관련법규를 준수하기 위해 “개인정보처리방침”(이하 “본 방침”이라 함)을
            제정하고 이를 준수하고 있습니다. 본 방침은 법률의 제·개정, 정부의
            정책 변경, 회사 내부 방침의 변경에 따라 바뀔 수 있습니다. 회사는 본
            방침을 개정하는 경우 “회사 홈페이지(www.roominus.site)” 공지사항을
            통하여 공지할 것입니다. 정보주체는 “회사
            홈페이지(www.roominus.site)” 방문 시 수시로 본 방침을 확인해 주시기
            바랍니다. 본 방침은 다음과 같은 내용을 담고 있습니다. <br></br>{" "}
            제1조 총칙 <br></br>제2조 수집하는 개인정보의 항목 및 수집방법{" "}
            <br></br>제3조 개인정보의 수집 및 이용목적 <br></br>
            제4조 개인정보의 보유 및 이용기간<br></br> 제5조 개인정보의 파기절차
            및 파기방법<br></br> 제6조 개인정보의 제3자 제공 <br></br>제7조
            정보주체 및 법정대리인의 권리·의무와 그 행사방법 <br></br>제8조
            개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항 <br></br>
            제9조 개인정보 보호책임자 및 관리담당자 안내 <br></br>제10조
            개인정보 보호를 위한 안전성 확보조치 <br></br>
            <br></br>제11조 개인정보처리방침 변경에 따른 고지 <br></br>제1조
            총칙 ① “개인정보”란 살아 있는 개인에 관한 정보로서 성명,
            주민등록번호 및 영상 등을 통하여 개인을 알아볼 수 있는 정보(해당
            정보만으로는 특정 개인을 알아볼 수 없더라도 다른 정보와 쉽게
            결합하여 알아볼 수 있는 것을 포함)를 말합니다. ② “정보주체”란 회사에
            의하여 처리되는 정보에 의하여 알아볼 수 있는 사람(개인) 으로서 그
            정보의 주체가 되는 사람을 말합니다. ③ 회사는 정보주체의
            개인정보보호를 매우 중요시하며, 「개인정보 보호법」,「정보통신망법」
            및 행정자치부가 제정한 “표준 개인정보 보호지침” 등 관련 법령을
            준수하고 있습니다.회사는 본 방침을 통하여 정보주체가 제공하는
            개인정보가 어떠한 용도로 이용되고 있으며 개인정보보호를 위해 어떠한
            조치가 취해지고 있는지 알려 드립니다. ④ 회사는 본 방침의 지속적인
            개선을 위하여 본 방침을 개정하는데 필요한 절차를 정하고 있습니다.
            그리고 본 방침을 개정하는 경우 버전번호 등을 부여하여 개정된 사항을
            정보주체가 쉽게 열람할 수 있도록 하고 있습니다.
            <br></br> <br></br>제2조 수집하는 개인정보의 항목 및 수집방법
            [수집하는 개인정보의 항목] – 필수입력사항 : 이용자의 식별을 위한
            정보 – 입력정보 : 이름, 휴대폰번호, 이메일 주소 [개인정보의
            수집방법] – 홈페이지 내 예약 시스템을 통해 수집하고 있습니다. –
            회사는 정보주체가 회사의 개인정보 수집·이용 동의 각각의 내용에 대해
            “동의” 또는 “동의하지 않음”을 선택할 수 있는 절차를 마련하여,
            “동의”를 선택한 경우 개인정보 수집에 대해 동의한 것으로 봅니다.{" "}
            <br></br>
            <br></br>제3조 개인정보의 수집 및 이용목적 [개인정보의 수집 및
            이용목적] – 비회원 예매서비스 제공 – 예약 정보를 확인 및 관리하고,
            필요 시 예약 이행 여부 확인을 위해 예약자에게 연락을 취할 목적{" "}
            <br></br> <br></br>제4조 개인정보의 보유 및 이용기간 [개인정보의
            보유 및 이용기간] 회사는 정보주체가 동의를 철회 또는 삭제를 요청할
            때까지, 개인정보의 수집 또는 이용목적이 달성될 때까지 정보주체의
            개인정보를 보관하며 개인정보의 수집목적 또는 제공받은 목적이
            달성되면 즉시 파기합니다. 다만, 상법 등 관련 법령의 규정에 의하여
            거래관련 관리 의무 관계의 확인 등을 이유로 대금결제및재화들
            의공급에관한기록에 의거 5년간 보유합니다. 단, 개인정보 수집 또는
            이용목적이 달성된 경우 등에도 관련 법령에 의해 보존할 필요가 있는
            경우에는 정부주체의 개인정보를 보유할 수 있습니다. <br></br>{" "}
            <br></br>
            제5조개인정보의 파기절차 및 파기방법 ① 파기절차 – 회사는 원칙적으로
            정보주체가 동의를 철회하거나 개인정보 수집 및 이용 목적이 달성된
            후에는 해당 정보를 지체 없이 파기합니다. 단, 정보주체에게 개인정보
            보관기간에 대해 별도의 동의를 얻은 경우, 또는 법령에서 일정기간
            정보보관 의무를 부과하는 경우에는 해당기간 동안 개인정보를 안전하게
            보관합니다. ② 파기방법 – 전자적 파일 형태의 관련된 자료 및 데이터를
            전면 삭제하며, 출력물 등은 분쇄하는 방식으로 파기합니다.
            제6조개인정보의 제3자 제공 회사는 정보주체의 동의가 있거나 관련
            법령의 규정에 의한 경우를 제외하고는 어떠한 경우에도 제3조에서
            고지한 범위를 넘어 정보주체의 개인정보를 이용하거나 타인 또는
            타기업·기관에 제공하지 않습니다. 다만, 다음의 경우에는 관련 법령의
            규정에 의해 정보주체의 동의없이 개인정보를 수집한 목적 범위에서
            개인정보를 제공하는 것이 가능합니다. – 법률에 특별한 규정이 있거나
            법령상 의무를 준수하기 위하여 불가피한 경우 – 정보주체 또는 그
            법정대리인이 의사표시를 할 수 없는 상태에 있거나 주소불명 등으로
            사전 동의를 받을 수 없는 경우로서 명백히 정보주체 또는 제3자의
            급박한 생명, 신체, 재산의 이익을 위하여 필요하다고 인정되는 경우{" "}
            <br></br>
            <br></br>제7조 정보주체 및 법정대리인의 권리·의무와 그 행사방법
            정보주체 또는 법정대리인은 언제든지 등록되어 있는 자신 또는 당해 만
            14세 미만 아동의 개인정보를 정정·삭제, 처리정지, 동의철회를 요청하실
            수 있습니다. 개인정보 열람, 정정·삭제, 처리정지, 동의철회를 하고자
            할 경우에는 “제9조 개인정보 보호책임자 및 관리담당자 안내”에 기재된
            전화 또는 이메일로 연락하시면 본인확인 절차를 거친 후 지체없이
            조치하겠습니다. 정보주체는 개인정보를 최신의 상태로 정확하게
            입력하여 불의의 사고를 예방하여 주시기 바랍니다. 정보주체가 입력한
            부정확한 정보로 인하여 발생하는 사고의 책임은 정보주체 자신에게
            있으며, 타인 정보의 도용 등 허위정보를 입력할 경우 법률위반의 문제가
            발생할 수 있습니다. 정보주체는 개인정보를 보호받을 권리와 함께
            스스로를 보호하고 타인의 정보를 침해하지 않을 의무도 가지고
            있습니다. 정보주체의 개인정보가 유출되지 않도록 조심하시고 게시물을
            포함한 타인의 개인정보를 훼손하지 않도록 유의하여야 합니다. 만약 이
            같은 책임을 다하지 못하고 타인의 개인정보 및 존엄성을 훼손할 시에는
            관련 법령에 의하여 처벌받을 수 있습니다. <br></br> <br></br>
            제8조개인정보 자동수집 장치의 설치, 운영 및 그 거부에 관한 사항
            회사는 이용자의 정보를 수시로 저장하고 찾아내는 “쿠키(cookie)” 등을
            운용하지 않습니다. <br></br>
            <br></br>
            제9조개인정보 보호책임자 및 관리담당자 안내 개인정보를 보호하고
            개인정보와 관련한 불만을 처리하기 위하여 아래와 같이 개인정보
            보호책임자 및 실무담당자를 지정하고 있습니다. (개인정보보호법 제31조
            제1항에 따른 개인정보 보호책임자) 개인정보보호 책임자 연락처 E-mail:
            dev.team05.roominus@gmail.com <br></br>
            <br></br>제10조 개인정보 보호를 위한 안전성 확보조치 회사는
            정보주체의 개인정보를 처리함에 있어 개인정보가 분실, 도난, 누출,
            변조 또는 훼손되지 않도록 안전성 확보를 위해 다음과 같은 기술적,
            관리적, 물리적 대책을 강구하고 있습니다. 개인정보를 취급하는 직원을
            최소한으로 한정·관리하며, 회사 내 개인정보보호 전담조직 등을 통해
            개인정보 보호조치의 이행사항 및 취급자의 준수여부를 확인하여 문제
            발견 시 즉시 시정조치 하도록 하고 있습니다. 단, 정보주체 개인의
            부주의나 인터넷상의 문제로 개인정보가 유출되어 발생한 문제에
            대해서는 회사는 일체의 책임을 지지 않습니다.
            <br></br> <br></br>제11조 개인정보처리방침 변경에 따른 고지 법률의
            제ㆍ개정, 정부의 정책 변경, 회사 내부방침의 변경 또는 보안기술의
            변경에 따라 내용의 추가, 삭제 및 수정이 있을 시에는 지체없이
            홈페이지를 통해 변경내용 등을 공지하도록 하겠습니다. –
            개인정보처리방침 버전번호: v2.0 – 개인정보처리방침 시행일자: 2022년
            07월 21일 – 개인정보처리방침
          </p>
        </S.ContentsBox>
        <S.ButtonBox>
          <Link href={"/home"}>
            <a>
              <WebBlackButton type="button" title="돌아가기" />
            </a>
          </Link>
        </S.ButtonBox>
      </S.Container>
    </>
  );
}
